#include <stdio.h>               // นำเข้า libary Stdio.h (Starndard Input Output Header) มาใช้งานฟังก์ชั่น input,output

int main() {                     // สร้างฟังก์ชั่นหลักของโปรแกรม เพื่อเป็นจุดเริ่มต้นการทำงานเมื่อรันโปรแกรม

    int A = -2 + 5 * 2;                          // นิพจน์ A: ใช้ตัวดำเนินการ + และ * ซึ่ง * มีลำดับความสำคัญสูงกว่า โดยคำนวณ 5 * 2 ก่อน ได้ 10 แล้วจึงนำไปบวกกับ -2 ดังนั้น A = -2 + 10 → A = 8
    printf("A = %d\n", A);                       // แสดงผลลัพธ์ของ A

    int B = 10 / 2 * 3;                          // นิพจน์ B: ตัวดำเนินการ / และ * มีลำดับความสำคัญเท่ากัน แต่มีการประเมินจากซ้ายไปขวา โดยที่ 10 / 2 = 5, จากนั้น 5 * 3 = 15 ดังนั้น B = 5 * 3 → B = 15
    printf("B = %d\n", B);                       // แสดงผลลัพธ์ของ B

    int C = 6 / 2 + 3 * (4 % 2);                 // นิพจน์ C: มีการใช้วงเล็บร่วมกับ % ซึ่งมีลำดับความสำคัญสูงกว่าบวก โดยที่ 4 % 2 = 0 → 3 * 0 = 0 → 6 / 2 = 3 → 3 + 0 = 3 ดังนั้น C = 3 + 0 → C = 3
    printf("C = %d\n", C);                       // แสดงผลลัพธ์ของ C

    int D = (5 + 2) * 15 % 4;                    // นิพจน์ D: ใช้วงเล็บเพื่อบังคับการบวกก่อนการคูณ โดยที่ 5 + 2 = 7 → 7 * 15 = 105 → 105 % 4 = 1 ดังนั้น D = 105 % 4 → D = 1
    printf("D = %d\n", D);                       // แสดงผลลัพธ์ของ D

    int E = 6 + 2 * 2 - 6 / 2;                   // นิพจน์ E: มีทั้ง +, -, *, / โดย *, / มีลำดับสูงกว่า โดยที่ 2 * 2 = 4 → 6 / 2 = 3 → 6 + 4 - 3 = 7 ดั้งนั้น E = 6 + 4 - 3 → E = 7
    printf("E = %d\n", E);                       // แสดงผลลัพธ์ของ E

    int F = 5 + 3 * 2 - 8 / 4 + (6 % 5);         // นิพจน์ F: มีการใช้ *, /, %, + และ - ร่วมกัน โดยที่ 3 * 2 = 6, 8 / 4 = 2, 6 % 5 = 1 ดังนั้น F = 5 + 6 - 2 + 1 → F = 10
    printf("F = %d\n", F);                       // แสดงผลลัพธ์ของ F

    int G = (4 + 3) * 2 - 10 / (2 + 3);          // นิพจน์ G: ใช้วงเล็บเพื่อควบคุมลำดับการคำนวณ โดยที่ 4 + 3 = 7 → 7 * 2 = 14 → 2 + 3 = 5 → 10 / 5 = 2 → 14 - 2 = 12 ดังนั้น G = 14 - 2 → G = 12
    printf("G = %d\n", G);                       // แสดงผลลัพธ์ของ G

    return 0;                    // ทำการ reset ค่าของ code เพื่อสิ้นสุดกระบวนการ
}
