#include <stdio.h>      // นำเข้า libary Stdio.h (Starndard Input Output Header) มาใช้งานฟังก์ชั่น input,output

int main() {                                    // สร้างฟังก์ชั่นหลักของโปรแกรม เพื่อเป็นจุดเริ่มต้นการทำงานเมื่อรันโปรแกรม
    int a = 5, b = 2;                           // กำหนดตัวแปรจำนวนเต็ม โดยที่ a มีค่าเป็น 5 และ b มีค่าเป็น 2
    float x = 3.0, y = 4.5;                     // กำหนดตัวแปรทศนิยม โดยที่ x มีค่าเป็น 3.0 และ y มีค่าเป็น 4.5

    int r1 = a++ * b + (int)y % 3;              //(1)คำนวณ * และ % ก่อนค่อยนำมา + กัน
    int r2 = (a > b) && ((int)x / b < 2);       //(2)เปรียบเทียบว่าค่า a>b และ (int)x/b<2 เป็นจริงหรือเท็จ
    float r3 = ++x * y - a / 2;                 //(3)คำนวณ * และ / ก่อนจากนั้นจึงนำมา -
    float r4 = ((x += 1.5) > y) || (b-- > 0);   //(4)เปรียบเทียบค่า((x += 1.5) > y) || (b-- > 0) ว่าเป็นจริงหรือเท็จ

    printf("ผลลัพธ์ r1 = %d\n", r1);      //แสดงผลลัพธ์ r1 เป็นจำนวนเต็ม
    printf("ผลลัพธ์ r2 = %d\n", r2);      //แสดงผลลัพธ์ r2 เป็นจำนวนเต็ม
    printf("ผลลัพธ์ r3 = %.2f\n", r3);    //แสดงผลลัพธ์ r3 เป็นเลขทศนิยม 2 ตำแหน่ง
    printf("ผลลัพธ์ r4 = %.2f\n", r4);    //แสดงผลลัพธ์ r4 เป็นเลขทศนิยม 2 ตำแหน่ง  

    return 0;   // ทำการ reset ค่าของ code เพื่อสิ้นสุดกระบวนการ
}