#include <stdio.h>      // นำเข้า libary Stdio.h (Starndard Input Output Header) มาใช้งานฟังก์ชั่น input,output

int main() {
    int a = 5, b = 17;              // กำหนดตัวแปรจำนวนเต็ม โดยที่ a มีค่าเป็น 5 และ b มีค่าเป็น 17
    float c = 8.5, d = 4.0;         // กำหนดตัวแปรทศนิยม โดยที่ c มีค่าเป็น 8.5 และ d มีค่าเป็น 4.0

    printf("บรรทัดที่ 1 : a = %d, b = %d, c = %.1f, d = %.1f\n", a, b, c, d);     // แสดงค่าที่กำหนดไว้ทั้งหมด

    printf("บรรทัดที่ 2 : d + a = %.1f\n", d + a);                                // ผลการคำนวณของ d + a
    printf("บรรทัดที่ 3 : a - b = %d\n", a - b);                                  // ผลการคำนวณของ a - b
    printf("บรรทัดที่ 4 : c * d = %.2f\n", c * d);                                // ผลการคำนวณของ c * d
    printf("บรรทัดที่ 5 : a * c = %.2f\n", a * c);                                // ผลการคำนวณของ a * c
    printf("บรรทัดที่ 6 : c / d = %.2f\n", c / d);                                // ผลการคำนวณของ c / d
    printf("บรรทัดที่ 7 : b / c = %.2f\n", b / c);                                // ผลการคำนวณของ b / c
    printf("บรรทัดที่ 8 : a %% b = %d\n", a % b);                                 // ผลการคำนวณของ a % b (ใช้ได้ เพราะเป็น int)
    printf("บรรทัดที่ 9 : (int)c %% a = %d\n", ((int)c) % a);                     // ผลการคำนวณของ c % a → ต้องแปลง c เป็น int ก่อน
    printf("บรรทัดที่ 10 : (int)c %% (int)d = %d\n", ((int)c) % ((int)d));        // ผลการคำนวณของ c % d → ต้องแปลงทั้ง c และ d เป็น int ก่อน

    return 0;           // ทำการ reset ค่าของ code เพื่อสิ้นสุดกระบวนการ
}

// บรรทัดที่ 1 แสดงค่าที่กำหนดไว้ทั้งหมด โดยที่ a=5 b=17 c=8.5 d =4.0
// บรรทัดที่ 2 ผลการคำนวณของ d + a โดยที่ 4.0 + 5 = 9.0
// บรรทัดที่ 3 ผลการคำนวณของ a - b โดยที่ 5 - 17 = -12
// บรรทัดที่ 4 ผลการคำนวณของ c * d โดยที่ 8.5 * 4.0 = 34.0
// บรรทัดที่ 5 ผลการคำนวณของ a * c โดยที่ 5 * 8.5 = 42.50
// บรรทัดที่ 6 ผลการคำนวณของ c / d โดยที่ 8.5 / 4.0 = 2.12
// บรรทัดที่ 7 ผลการคำนวณของ b / c โดยที่ 17 / 8.5 = 2.00
// บรรทัดที่ 8 ผลการคำนวณของ a % b (ใช้ได้ เพราะเป็น int) โดยที่ 5 % 17 = 5
// บรรทัดที่ 9 ผลการคำนวณของ c % a → ต้องแปลง c เป็น int ก่อน โดยที่ 8 % 5 = 3
// บรรทัดที่ 10 ผลการคำนวณของ c % d → ต้องแปลงทั้ง c และ d เป็น int ก่อน โดยที่ 8 % 4 = 0